In [1]:
import pandas as pd
import pickle
from sklearn.metrics import mean_absolute_error
import functions as func
import orga_functions as org

## Imports

In [2]:
x_test = pd.read_csv(org.path("00_x_test.csv"), sep=';')
#x_test = pd.read_csv(org.path("00_x_test.csv"), sep=';', index_col='date')
y_test = pd.read_csv(org.path("00_y_test.csv"), sep=';')

In [3]:
x_test.head(10)

,date,pt08_s1_co,c6h6_gt,pt08_s2_nmhc,no2_gt,pt08_s4_no2,t,ah
0,2004-12-27 02:00:00,954.0,2.7,953.579453,92.000000,1107.0,11.6,0.9411
1,2004-12-27 03:00:00,875.0,1.5,953.579453,106.251831,1049.0,11.5,0.9106
2,2004-12-27 04:00:00,877.0,1.3,953.579453,55.000000,1023.0,11.7,0.8888
3,2004-12-27 05:00:00,826.0,0.7,953.579453,46.000000,978.0,11.9,0.8527
4,2004-12-27 06:00:00,862.0,1.4,953.579453,67.000000,1020.0,12.5,0.8269
5,2004-12-27 07:00:00,938.0,3.0,953.579453,95.000000,1100.0,12.3,0.8562
6,2004-12-27 08:00:00,1205.0,9.1,943.000000,133.000000,1361.0,11.5,0.9302
7,2004-12-27 09:00:00,1171.0,10.0,978.000000,138.000000,1374.0,12.5,0.9113
8,2004-12-27 10:00:00,1131.0,8.6,926.000000,127.000000,1324.0,12.9,0.9335
9,2004-12-27 11:00:00,1074.0,6.4,832.000000,119.000000,1230.0,13.5,0.9261

In [4]:
# import model
with open(org.path("LinearRegression_ah_classifier.pkl"), 'rb') as f:
    linr_clf = pickle.load(f)

In [5]:
# predict for x_test
pred_y = func.pred_array(x_test, linr_clf)

## Result

In [6]:
check = func.check_df(x_test,y_test, linr_clf)
check

                     future_ah  predicted_ah
future_datetime
2004-12-27 08:00:00     0.9302      0.929537
2004-12-27 09:00:00     0.9113      0.905056
2004-12-27 10:00:00     0.9335      0.886420
2004-12-27 11:00:00     0.9261      0.857971
2004-12-27 12:00:00     0.9379      0.838315
...                        ...           ...
2005-02-06 19:00:00     0.3584      0.407870
2005-02-06 20:00:00     0.3385      0.421599
2005-02-06 21:00:00     0.3286      0.431890
2005-02-06 22:00:00     0.3304      0.434415
2005-02-06 23:00:00     0.3358      0.426008

[1000 rows x 2 columns]

In [7]:
mean_absolute_error(y_test, pred_y)

0.061853152701865186

# JSON

In [8]:
#import original json data
json_original = func.json_to_df("02_LiveData.json")
json_original

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH
0,07/02/2005,00.00.00,6.14,1565,142.0,13.35,1920.0,28.0,990.0,249,1734.0,452.0,10.77,22.83,2.13
1,07/02/2005,01.00.00,-215.67,1864,-122.0,22.65,53.0,1158.0,-144.0,35,422.0,1036.0,-196.32,85.49,-195.50
2,07/02/2005,02.00.00,2933.29,1459,4833.0,30.82,3150.0,1058.0,3158.0,304,2867.0,372.0,1963.63,88.21,2701.54
3,07/02/2005,03.00.00,9.18,-221,3736.0,-206.35,613.0,2330.0,2403.0,-23,2950.0,237.0,0.41,1748.09,1.99
4,07/02/2005,04.00.00,1.88,1150,NaN,NaN,NaN,NaN,NaN,277,NaN,NaN,NaN,NaN,NaN
5,07/02/2005,05.00.00,6.37,1629,56.0,28.90,2010.0,1287.0,608.0,106,1603.0,1457.0,2.83,24.35,0.88
6,07/02/2005,06.00.00,7.33,1203,692.0,46.80,552.0,883.0,1518.0,234,1121.0,1652.0,18.74,15.01,0.94
7,07/02/2005,07.00.00,4.60,1888,665.0,20.59,2177.0,598.0,1855.0,312,2217.0,328.0,41.62,63.65,1.94
8,07/02/2005,08.00.00,6.52,1383,1121.0,6.12,1755.0,699.0,509.0,169,1554.0,1549.0,14.53,46.07,1.91

In [9]:
# import only columns needed by the model, other columns dropped 
json_df = func.json_to_ml_features_df("02_LiveData.json", linr_clf)

In [10]:
json_df

,pt08_s1_co,c6h6_gt,pt08_s2_nmhc,no2_gt,pt08_s4_no2,t,ah
date,,,,,,,
2005-02-07 00:00:00,1565.000000,13.350000,953.579453,106.251831,1734.0,10.77,2.13
2005-02-07 01:00:00,1098.303412,22.650000,953.579453,35.000000,1734.0,10.77,2.13
2005-02-07 02:00:00,1459.000000,10.458205,953.579453,106.251831,1734.0,10.77,2.13
2005-02-07 03:00:00,1098.303412,10.458205,953.579453,106.251831,1734.0,0.41,1.99
2005-02-07 04:00:00,1150.000000,10.458205,953.579453,106.251831,1734.0,0.41,1.99
2005-02-07 05:00:00,1629.000000,28.900000,953.579453,106.000000,1603.0,2.83,0.88
2005-02-07 06:00:00,1203.000000,10.458205,953.579453,106.251831,1121.0,18.74,0.94
2005-02-07 07:00:00,1098.303412,20.590000,953.579453,106.251831,2217.0,41.62,1.94
2005-02-07 08:00:00,1383.000000,6.120000,953.579453,169.000000,1554.0,14.53,1.91

In [11]:
func.prediction_df(json_df, linr_clf)

                     predicted_ah
future_datetime
2005-02-07 06:00:00      1.936470
2005-02-07 07:00:00      1.943911
2005-02-07 08:00:00      1.929109
2005-02-07 09:00:00      1.733808
2005-02-07 10:00:00      1.734581
2005-02-07 11:00:00      0.834021
2005-02-07 12:00:00      0.993563
2005-02-07 13:00:00      1.930417
2005-02-07 14:00:00      1.772040

# Single Entry JSON

In [12]:
# original DataFrame
json_single_og = func.json_to_df("03_LiveData_single.json")
json_single_og

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH,Katze
0,07/02/2005,09.00.00,9.92,1890,620,50.49,1265,499,963,235,1301,2365,40.06,20.41,2.17,missy

In [13]:
# entire DataPreparation and Prediction - ALL IN ONE
func.pred_json_df("03_LiveData_single.json", linr_clf)

                     predicted_ah
future_datetime
2005-02-07 15:00:00      2.197405